In [2]:
import numpy as np
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [5]:
sample_pandas_data = Series([0,10,20,30, 40, 50, 60, 70, 80,90])

In [6]:
sample_pandas_data

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [7]:
sample_pandas_index_data = pd.Series([0,10,20,30,40,50,60,70,80,90],
                                    index=['a','b','c','d','e','f','g','h','i','j'])

In [8]:
sample_pandas_index_data

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [12]:
attri_data1 = {'ID':['100','101', '102', '103','104'],
              'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
              'Birth_year':[1990, 1989, 1992, 1997, 1982 ],
              'Name': ['Hiroshi','Akiko','Yuki','Satoru','Steve']}

In [13]:
attri_data1

{'ID': ['100', '101', '102', '103', '104'],
 'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
 'Birth_year': [1990, 1989, 1992, 1997, 1982],
 'Name': ['Hiroshi', 'Akiko', 'Yuki', 'Satoru', 'Steve']}

In [14]:
attri_data_frame1 = DataFrame(attri_data1)

In [15]:
attri_data_frame1

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve